In [47]:
import pandas as pd
import numpy as np

df = pd.read_csv('train.csv')

In [48]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [49]:
dicionario = {
    'COLUNA_A': [1, 2, 3, 4, 5],
    'COLUNA_B': ['a', 'b', 'c', 'd', 'e'],
    'COLUNA_C': [100, 200, 300, 400, 500]
}

In [50]:
df = pd.DataFrame(dicionario)
df

   COLUNA_A COLUNA_B  COLUNA_C
0         1        a       100
1         2        b       200
2         3        c       300
3         4        d       400
4         5        e       500

In [51]:
produtos = pd.Series(['Celular', 'Tablet', 'Notebook', 'Fone de Ouvido', 'Smartwatch'])
quantidade_estoque = pd.Series([15, 8, 20, 5, 12])

dicionario = {
    'nome': ['Celular', 'Tablet', 'Notebook', 'Fone de Ouvido', 'Smartwatch'],
    'qtd_estoque': [15, 8, 20, 5, 12]
}

df = pd.DataFrame(dicionario)
df

             nome  qtd_estoque
0         Celular           15
1          Tablet            8
2        Notebook           20
3  Fone de Ouvido            5
4      Smartwatch           12

In [52]:
dados = [
  [1.69, 87.0],
  [1.59, 56.5],
  [1.69, 90.3],
  [1.74, 78.6]
]
df = pd.DataFrame(dados, columns=['altura', 'peso'])
df

   altura  peso
0    1.69  87.0
1    1.59  56.5
2    1.69  90.3
3    1.74  78.6

In [53]:
produtos = pd.Series(['Celular', 'Tablet', 'Notebook', 'Fone de Ouvido', 'Smartwatch'])
quantidade_estoque = pd.Series([15, 8, 20, 5, 12])

dicionario = {
    'nome': ['Celular', 'Tablet', 'Notebook', 'Fone de Ouvido', 'Smartwatch'],
    'qtd_estoque': [15, 8, 20, 5, 12]
}

df = pd.DataFrame(dicionario, index=[214314, 431431, 532453, 542234, 431413])
df

                  nome  qtd_estoque
214314         Celular           15
431431          Tablet            8
532453        Notebook           20
542234  Fone de Ouvido            5
431413      Smartwatch           12

In [54]:
df.shape

(5, 2)

In [55]:
df.index

Index([214314, 431431, 532453, 542234, 431413], dtype='int64')

In [56]:
df.to_csv("produtos.csv", index=False)

In [57]:
dados = [
  [1.69, 87.0],
  [1.59, 56.5],
  [1.69, 90.3],
  [1.74, 78.6]
]
df = pd.DataFrame(dados, columns=['altura', 'peso'], index = ['a', 'b', 'c', 'd'])
df

   altura  peso
a    1.69  87.0
b    1.59  56.5
c    1.69  90.3
d    1.74  78.6

In [58]:
df['peso']

a    87.0
b    56.5
c    90.3
d    78.6
Name: peso, dtype: float64

In [59]:
df[['peso', 'altura']]

   peso  altura
a  87.0    1.69
b  56.5    1.59
c  90.3    1.69
d  78.6    1.74

In [60]:
df.iloc[1]

altura     1.59
peso      56.50
Name: b, dtype: float64

In [61]:
df.iloc[0]

altura     1.69
peso      87.00
Name: a, dtype: float64

In [62]:
df.loc['b']

altura     1.59
peso      56.50
Name: b, dtype: float64

In [63]:
df['peso'][1]

C:\Users\Drac3\AppData\Local\Temp\ipykernel_10508\2551684995.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df['peso'][1]

56.5

In [64]:
df['peso'].loc['b']

56.5

In [65]:
df.iloc[1, 0]

1.59

In [66]:
df.loc['b', 'altura']

1.59

In [67]:
df

   altura  peso
a    1.69  87.0
b    1.59  56.5
c    1.69  90.3
d    1.74  78.6

In [68]:
df.iat[1, 0] # No caso do iat, acessamos [linha, coluna], usando a posiÃ§Ã£o

1.59

In [69]:
df.at[1, 'altura'] # No caso do at, acessamos [linha, coluna], usando os rÃ³tulos

KeyError: 1

In [ ]:
df.at[1] # isto jÃ¡ nÃ£o conseguiremos fazer

In [ ]:
dados = [
  [1.69, 87.0, 'Fulano'],
  [1.59, 56.5, 'Sicrana'],
  [1.69, 90.3, 'Beltrana'],
  [1.74, 78.6, 'JoÃ£o']
]
df = pd.DataFrame(dados, columns=['altura', 'peso', 'nomes'])
df

In [ ]:
df.loc[1:3, ['peso', 'nomes']]

In [ ]:
df[['nomes', 'altura']]

In [ ]:
df

In [ ]:
df[df['peso'] > 78.0]

In [ ]:
df

In [ ]:
df[(df['peso'] > 78.0) & (df['altura'] > 1.70)]

In [ ]:
df.query('peso > 78.0 and altura > 1.70')

In [ ]:
df

In [ ]:
df.at[1, 'altura'] = 1.50
df

In [ ]:
df.loc[:2, 'peso'] = [77.2, 64.2, 85.0]
df

In [ ]:
df['sobrenomes'] = ['Marques', 'MagalhÃ£es', 'Silva', 'Terra']
df

In [ ]:
df['altura'] > 1.70

In [ ]:
df['altura > 1,70'] = df['altura'] > 1.70
df

In [ ]:
df['altura ** 2'] = df['altura'] ** 2
df

In [ ]:
df.to_numpy()

In [ ]:
df.values

In [ ]:
df1 = pd.DataFrame({'x': [1, 2, 3, 4], 'y': [2, 4, 6, 8]})
df2 = pd.DataFrame({'x': [1, 2, 3, 4], 'y': [3, 6, 9, 12]})
df3 = pd.DataFrame({'a': [1, 2, 3, 4], 'y': [3, 6, 9, 12]})

print(df1)
print(df2)
print(df3)

In [ ]:
resultado1 = df1 + df2
print(resultado1)

In [ ]:
resultado2 = df1 + df3
print(resultado2)

In [ ]:
resultado3 = df1.add(df3, fill_value=0)
print(resultado3)

In [ ]:
data = {'altura': [1.69, 1.50, 1.69, 1.74],
        'peso': [77.2, 64.2, 85.0, 78.6],
        'nomes': ['Fulano', 'Sicrana', 'Beltrana', 'JoÃ£o']}
index = ['b', 'a', 'c', 'f']

df = pd.DataFrame(data, index=index)
df

In [ ]:
df.sort_index()

In [ ]:
df.sort_values('peso')

In [ ]:
df.sort_values('peso', ascending=False)

In [ ]:
df[['nomes', 'peso', 'altura']]

In [ ]:
df.columns

In [ ]:
df = df.drop(columns=['nomes'])
df

In [ ]:
df = df.rename(columns={'altura': 'ALTURA', 'peso': 'PESO'})
df

In [ ]:
df['PESO'].astype(np.int64)

In [ ]:
data = {
    'altura': [1.69, 1.50, 1.69, 1.74],
    'peso': [77.2, 64.2, 85.0, 78.6],
    'nomes': ['Fulano', 'Sicrana', 'Beltrana', 'JoÃ£o'],
    'idade': [30, 25, 35, 40],  # Adicionando a coluna 'idade'
    'sexo': ['M', 'F', 'F', 'M']  # Adicionando a coluna 'sexo'
}

index = ['b', 'a', 'c', 'f']

df = pd.DataFrame(data, index=index)
df

In [ ]:
colunas_desejadas = ['nomes', 'idade', 'altura', 'peso']
df = df[colunas_desejadas]
df

In [ ]:
df.reset_index()

In [ ]:
df.set_index('nomes')

In [ ]:
data = {
    'altura': [1.69, 1.50, 1.58, 1.69, 1.74, 1.73],
    'peso': [77.2, 68.0, 65.0, 85.0, 78.6, 69.2]
}

df = pd.DataFrame(data)
df

In [ ]:
df['imc'] = df.apply(lambda row: row['peso'] / (row['altura'] ** 2), axis=1)
df

In [ ]:
# Definir a funÃ§Ã£o para calcular o IMC
def calcular_imc(row):
    return row['peso'] / (row['altura'] ** 2)

# Aplicar a funÃ§Ã£o usando apply
df['imc'] = df.apply(calcular_imc, axis=1)
df

In [ ]:
data = {
    'altura': [1.69, 1.50, 1.69, np.nan],
    'peso': [77.2, np.nan, 85.0, 78.6],
    'nomes': ['Fulano', 'Sicrana', 'Beltrana', 'JoÃ£o']
}
index = ['b', 'a', 'c', 'f']

df = pd.DataFrame(data, index=index)
df

In [ ]:
df.isnull().sum()

In [ ]:
df.dropna()

In [ ]:
df

In [ ]:
df = df.fillna(-1)

In [ ]:
df.replace(-1, 60)

In [ ]:
data = {
    'a': [1, 1, 2, 2],
    'b': [0, 0, 1, 2]
}

df_dup = pd.DataFrame(data)
df_dup

In [ ]:
df_dup.drop_duplicates()

In [ ]:
data = {
    'altura': [1.69, 1.50, 1.58, 1.69, 1.74, 1.73],
    'peso': [77.2, 68.0, 65.0, 85.0, 78.6, 69.2]
}
df = pd.DataFrame(data)
df

In [ ]:
df.mean()

In [ ]:
df.min()

In [ ]:
df.max()

In [ ]:
df.describe()

In [ ]:
data = {
    'categoria': ['eletrÃ´nicos', 'eletrÃ´nicos', 'vestuÃ¡rio', 'vestuÃ¡rio', 'acessÃ³rios'],
    'valor_venda': [1000, 1500, 800, 1200, 500]
}
df_vendas = pd.DataFrame(data)
df_vendas

In [ ]:
df_vendas.groupby('categoria').sum()

In [ ]:
df_vendas.groupby('categoria').mean()

In [ ]:
data = {
    'categoria': ['eletrÃ´nicos', 'eletrÃ´nicos', 'vestuÃ¡rio', 'vestuÃ¡rio', 'acessÃ³rios'],
    'mes': ['jan', 'jan', 'fev', 'fev', 'jan'],
    'valor_venda': [1000, 1500, 800, 1200, 500]
}

df_vendas = pd.DataFrame(data)
df_vendas

In [ ]:
df_vendas.groupby(['categoria', 'mes']).sum()

In [ ]:
df_vendas.groupby(['categoria', 'mes']).median()

In [ ]:
df_vendas.groupby(['categoria', 'mes']).max()

In [ ]:
data = {
    'altura': [1.69, 1.50, 1.58, 1.69, 1.74, 1.73],
    'peso': [77.2, 68.0, 65.0, 85.0, 78.6, 69.2],
    'genero': [0.0, 0.0, 0.0, 1.0, 1.0, 1.0],
    'carioca': [1, 0, 1, 0, 1, 0]
}

df = pd.DataFrame(data)
df

In [ ]:
df.pivot_table(index='genero', columns='carioca', values='peso', aggfunc=np.max)

In [ ]:
df.pivot_table(index='carioca', columns='genero', values='peso', aggfunc=np.sum)